Documents/КадрыУвольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>КадрыУвольнение</Name>
			<Comment>Увольнение (закрытие вакансии)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Сотрудники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КадрыУвольнение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	ПересчетИсполненийСотрудника();
КонецПроцедуры

&НаСервере
Процедура ПересчетИсполненийСотрудника()
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Сотрудник.Очистить();
	
	// активные исполнения на момент увольнения
	тзИсполнения =  УП_КадрыСервер.СотрудникиФизЛица( Документ.ФизическоеЛицо, Документ.ДатаУвольнения );
	Если  тзИсполнения.Количество() <> 0 Тогда 
		Документ.Сотрудник.Загрузить(  тзИсполнения );
	КонецЕсли;
	
	Для Каждого Стр ИЗ Документ.Сотрудник Цикл
		Стр.Активна = Истина;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы( Документ, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено( Объект.ДатаУвольнения ) Тогда
		Объект.ДатаУвольнения = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПересчетИсполненийСотрудника();
КонецПроцедуры
